PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_tsi.h
/* TSI device information structrue */
typedef struct {
    hal_tsi_irq_struct               tsi_irq;                     /*!< TSI device interrupt callback function pointer structure */
    hal_tsi_error_enum               error_state;                 /*!< TSI error state */
    hal_tsi_state_enum               state;                       /*!< TSI state */
    hal_mutex_enum                   mutex;                       /*!< mutex */
    void                             *priv;                       /*!< priv data */
} hal_tsi_dev_struct;

/* @PARA: tsi_init */
/* @STRUCT: TSI init struct */
typedef struct{
    uint32_t charge_time;                                         /*!< charge state duration time */
    uint32_t transfer_time;                                       /*!< charge transfer state duration time */
    uint32_t ctclk_div;                                           /*!< charge transfer clock(ctclk) division factor */
    uint32_t seq_max;                                             /*!< max cycle number */
    uint32_t extend_charge_state;                                 /*!< extend charge state */
    uint32_t ecclk_div;                                           /*!< extend charge clock(ecclk) division factor */
    uint32_t extend_charge_time;                                  /*!< extend charge state maximum duration time */
    uint32_t pin_mode;                                            /*!< pin mode */
    uint32_t edge_sel;                                            /*!< edge selection */
    uint32_t trig_mode;                                           /*!< trigger mode selection */
    uint32_t sample_pins;                                         /*!< sample pins */
    uint32_t channel_pins;                                        /*!< channel pins */
    uint32_t shield_pins;                                         /*!< shield pins */
}hal_tsi_init_struct;

/* @STRUCT_MEMBER: charge_time */
/* @DEFINE: charge state duration time */
#define TSI_CHARGE_1CTCLK           CTL_CDT(0)                    /*!< the duration time of charge state is 1 CTCLK */
#define TSI_CHARGE_2CTCLK           CTL_CDT(1)                    /*!< the duration time of charge state is 2 CTCLK */
#define TSI_CHARGE_3CTCLK           CTL_CDT(2)                    /*!< the duration time of charge state is 3 CTCLK */
#define TSI_CHARGE_4CTCLK           CTL_CDT(3)                    /*!< the duration time of charge state is 4 CTCLK */
#define TSI_CHARGE_5CTCLK           CTL_CDT(4)                    /*!< the duration time of charge state is 5 CTCLK */
#define TSI_CHARGE_6CTCLK           CTL_CDT(5)                    /*!< the duration time of charge state is 6 CTCLK */
#define TSI_CHARGE_7CTCLK           CTL_CDT(6)                    /*!< the duration time of charge state is 7 CTCLK */
#define TSI_CHARGE_8CTCLK           CTL_CDT(7)                    /*!< the duration time of charge state is 8 CTCLK */
#define TSI_CHARGE_9CTCLK           CTL_CDT(8)                    /*!< the duration time of charge state is 9 CTCLK */
#define TSI_CHARGE_10CTCLK          CTL_CDT(9)                    /*!< the duration time of charge state is 10 CTCLK */
#define TSI_CHARGE_11CTCLK          CTL_CDT(10)                   /*!< the duration time of charge state is 11 CTCLK */
#define TSI_CHARGE_12CTCLK          CTL_CDT(11)                   /*!< the duration time of charge state is 12 CTCLK */
#define TSI_CHARGE_13CTCLK          CTL_CDT(12)                   /*!< the duration time of charge state is 13 CTCLK */
#define TSI_CHARGE_14CTCLK          CTL_CDT(13)                   /*!< the duration time of charge state is 14 CTCLK */
#define TSI_CHARGE_15CTCLK          CTL_CDT(14)                   /*!< the duration time of charge state is 15 CTCLK */
#define TSI_CHARGE_16CTCLK          CTL_CDT(15)                   /*!< the duration time of charge state is 16 CTCLK */

/* @STRUCT_MEMBER: transfer_time */
/* @DEFINE: charge transfer state duration time */
#define TSI_TRANSFER_1CTCLK         CTL_CTDT(0)                   /*!< the duration time of transfer state is 1 CTCLK */
#define TSI_TRANSFER_2CTCLK         CTL_CTDT(1)                   /*!< the duration time of transfer state is 2 CTCLK */
#define TSI_TRANSFER_3CTCLK         CTL_CTDT(2)                   /*!< the duration time of transfer state is 3 CTCLK */
#define TSI_TRANSFER_4CTCLK         CTL_CTDT(3)                   /*!< the duration time of transfer state is 4 CTCLK */
#define TSI_TRANSFER_5CTCLK         CTL_CTDT(4)                   /*!< the duration time of transfer state is 5 CTCLK */
#define TSI_TRANSFER_6CTCLK         CTL_CTDT(5)                   /*!< the duration time of transfer state is 6 CTCLK */
#define TSI_TRANSFER_7CTCLK         CTL_CTDT(6)                   /*!< the duration time of transfer state is 7 CTCLK */
#define TSI_TRANSFER_8CTCLK         CTL_CTDT(7)                   /*!< the duration time of transfer state is 8 CTCLK */
#define TSI_TRANSFER_9CTCLK         CTL_CTDT(8)                   /*!< the duration time of transfer state is 9 CTCLK */
#define TSI_TRANSFER_10CTCLK        CTL_CTDT(9)                   /*!< the duration time of transfer state is 10 CTCLK */
#define TSI_TRANSFER_11CTCLK        CTL_CTDT(10)                  /*!< the duration time of transfer state is 11 CTCLK */
#define TSI_TRANSFER_12CTCLK        CTL_CTDT(11)                  /*!< the duration time of transfer state is 12 CTCLK */
#define TSI_TRANSFER_13CTCLK        CTL_CTDT(12)                  /*!< the duration time of transfer state is 13 CTCLK */
#define TSI_TRANSFER_14CTCLK        CTL_CTDT(13)                  /*!< the duration time of transfer state is 14 CTCLK */
#define TSI_TRANSFER_15CTCLK        CTL_CTDT(14)                  /*!< the duration time of transfer state is 15 CTCLK */
#define TSI_TRANSFER_16CTCLK        CTL_CTDT(15)                  /*!< the duration time of transfer state is 16 CTCLK */

/* @STRUCT_MEMBER: ctclk_div */
/* @DEFINE: charge transfer clock(ctclk) division factor */
#define TSI_CTCDIV_DIV1            ((uint32_t)0x00000000U)         /*!< fCTCLK = fHCLK */
#define TSI_CTCDIV_DIV2            ((uint32_t)0x00000001U)         /*!< fCTCLK = fHCLK/2 */
#define TSI_CTCDIV_DIV4            ((uint32_t)0x00000002U)         /*!< fCTCLK = fHCLK/4 */
#define TSI_CTCDIV_DIV8            ((uint32_t)0x00000003U)         /*!< fCTCLK = fHCLK/8 */
#define TSI_CTCDIV_DIV16           ((uint32_t)0x00000004U)         /*!< fCTCLK = fHCLK/16 */
#define TSI_CTCDIV_DIV32           ((uint32_t)0x00000005U)         /*!< fCTCLK = fHCLK/32 */
#define TSI_CTCDIV_DIV64           ((uint32_t)0x00000006U)         /*!< fCTCLK = fHCLK/64 */
#define TSI_CTCDIV_DIV128          ((uint32_t)0x00000007U)         /*!< fCTCLK = fHCLK/128 */
#define TSI_CTCDIV_DIV256          ((uint32_t)0x00000008U)         /*!< fCTCLK = fHCLK/256 */
#define TSI_CTCDIV_DIV512          ((uint32_t)0x00000009U)         /*!< fCTCLK = fHCLK/512 */
#define TSI_CTCDIV_DIV1024         ((uint32_t)0x0000000AU)         /*!< fCTCLK = fHCLK/1024 */
#define TSI_CTCDIV_DIV2048         ((uint32_t)0x0000000BU)         /*!< fCTCLK = fHCLK/2048 */
#define TSI_CTCDIV_DIV4096         ((uint32_t)0x0000000CU)         /*!< fCTCLK = fHCLK/4096 */
#define TSI_CTCDIV_DIV8192         ((uint32_t)0x0000000DU)         /*!< fCTCLK = fHCLK/8192 */
#define TSI_CTCDIV_DIV16384        ((uint32_t)0x0000000EU)         /*!< fCTCLK = fHCLK/16384 */
#define TSI_CTCDIV_DIV32768        ((uint32_t)0x0000000FU)         /*!< fCTCLK = fHCLK/32768 */

/* @STRUCT_MEMBER: seq_max */
/* @DEFINE: max cycle number */
#define TSI_MAXNUM255              CTL_MCN(0)                      /*!< the max cycle number of a sequence is 255 */
#define TSI_MAXNUM511              CTL_MCN(1)                      /*!< the max cycle number of a sequence is 511 */
#define TSI_MAXNUM1023             CTL_MCN(2)                      /*!< the max cycle number of a sequence is 1023 */
#define TSI_MAXNUM2047             CTL_MCN(3)                      /*!< the max cycle number of a sequence is 2047 */
#define TSI_MAXNUM4095             CTL_MCN(4)                      /*!< the max cycle number of a sequence is 4095 */
#define TSI_MAXNUM8191             CTL_MCN(5)                      /*!< the max cycle number of a sequence is 8191 */
#define TSI_MAXNUM16383            CTL_MCN(6)                      /*!< the max cycle number of a sequence is 16383 */

