PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_tsi.h
/* @STRUCT_MEMBER: extend_charge_state */
/* @DEFINE: extend charge state */
#define TSI_EXTEND_CHARGE_DISABLE  ((uint32_t)0x00000000U)         /*!< extend charge state disable */
#define TSI_EXTEND_CHARGE_ENABLE   ((uint32_t)0x00000001U)         /*!< extend charge state enable */

/* @STRUCT_MEMBER: ecclk_div */
/* @DEFINE: extend charge clock(ecclk) division factor */
#define TSI_EXTEND_DIV1            ((uint32_t)0x00000000U)         /*!< fECCLK = fHCLK */
#define TSI_EXTEND_DIV2            ((uint32_t)0x00000001U)         /*!< fECCLK = fHCLK/2 */
#define TSI_EXTEND_DIV3            ((uint32_t)0x00000002U)         /*!< fECCLK = fHCLK/3 */
#define TSI_EXTEND_DIV4            ((uint32_t)0x00000003U)         /*!< fECCLK = fHCLK/4 */
#define TSI_EXTEND_DIV5            ((uint32_t)0x00000004U)         /*!< fECCLK = fHCLK/5 */
#define TSI_EXTEND_DIV6            ((uint32_t)0x00000005U)         /*!< fECCLK = fHCLK/6 */
#define TSI_EXTEND_DIV7            ((uint32_t)0x00000006U)         /*!< fECCLK = fHCLK/7 */
#define TSI_EXTEND_DIV8            ((uint32_t)0x00000007U)         /*!< fECCLK = fHCLK/8 */

/* @STRUCT_MEMBER: extend_charge_time */
/* @=NULL */

/* @STRUCT_MEMBER: pin_mode */
/* @DEFINE: pin mode */
#define TSI_OUTPUT_LOW             ((uint32_t)0x00000000U)         /*!< TSI pin will output low when IDLE */
#define TSI_INPUT_FLOATING         TSI_CTL0_PINMOD                 /*!< TSI pin will keep input_floating when IDLE */

/* @STRUCT_MEMBER: edge_sel */
/* @DEFINE: edge selection */
#define TSI_FALLING_TRIGGER        ((uint32_t)0x00000000U)         /*!< falling edge trigger TSI charge transfer sequence */
#define TSI_RISING_TRIGGER         TSI_CTL0_EGSEL                  /*!< rising edge trigger TSI charge transfer sequence */

/* @PARA: trig_mode */
/* @DEFINE:tsi hardware trigger */
#define TSI_HW_TRIGGER_DISABLE      ((uint32_t)0x00000000U)         /*!< hardware trigger disable */
#define TSI_HW_TRIGGER_ENABLE       TSI_CTL0_TRGMOD                 /*!< hardware trigger enable */

/* @STRUCT_MEMBER: sample_pins */
/* @DEFINE: sample_pins selection */
#define TSI_G0P0             BIT(0)                                 /*!< TSI G0P0 */
#define TSI_G0P1             BIT(1)                                 /*!< TSI G0P1 */
#define TSI_G0P2             BIT(2)                                 /*!< TSI G0P2 */
#define TSI_G0P3             BIT(3)                                 /*!< TSI G0P3 */
#define TSI_G1P0             BIT(4)                                 /*!< TSI G1P0 */
#define TSI_G1P1             BIT(5)                                 /*!< TSI G1P1 */
#define TSI_G1P2             BIT(6)                                 /*!< TSI G1P2 */
#define TSI_G1P3             BIT(7)                                 /*!< TSI G1P3 */
#define TSI_G2P0             BIT(8)                                 /*!< TSI G2P0 */
#define TSI_G2P1             BIT(9)                                 /*!< TSI G2P1 */
#define TSI_G2P2             BIT(10)                                /*!< TSI G2P2 */
#define TSI_G2P3             BIT(11)                                /*!< TSI G2P3 */
#define TSI_G3P0             BIT(12)                                /*!< TSI G3P0 */
#define TSI_G3P1             BIT(13)                                /*!< TSI G3P1 */
#define TSI_G3P2             BIT(14)                                /*!< TSI G3P2 */
#define TSI_G3P3             BIT(15)                                /*!< TSI G3P3 */
#define TSI_G4P0             BIT(16)                                /*!< TSI G4P0 */
#define TSI_G4P1             BIT(17)                                /*!< TSI G4P1 */
#define TSI_G4P2             BIT(18)                                /*!< TSI G4P2 */
#define TSI_G4P3             BIT(19)                                /*!< TSI G4P3 */
#define TSI_G5P0             BIT(20)                                /*!< TSI G5P0 */
#define TSI_G5P1             BIT(21)                                /*!< TSI G5P1 */
#define TSI_G5P2             BIT(22)                                /*!< TSI G5P2 */
#define TSI_G5P3             BIT(23)                                /*!< TSI G5P3 */

/* @STRUCT_MEMBER: channel_pins */
/* @DEFINE: channel_pins selection */
/* @REFER: TSI_G0P0 */

/* @STRUCT_MEMBER: shield_pins */
/* @DEFINE: shield_pins selection */
/* @REFER: TSI_G0P0 */
/* @FUNCTION: initialize TSI */
int32_t hal_tsi_init(hal_tsi_dev_struct *tsi_dev, hal_tsi_init_struct *tsi_init);

/* @END */

/* hal interface */
/* initialize the TSI structure with the default values */
void hal_tsi_struct_init(hal_tsi_struct_type_enum hal_struct_type, void *p_struct);
/* deinitialize TSI device structure and init structure */
int32_t hal_tsi_deinit(hal_tsi_dev_struct *tsi_dev);
/* start TSI module function */
int32_t hal_tsi_start(hal_tsi_dev_struct *tsi_dev);
/* stop tsi module function */
int32_t hal_tsi_stop(hal_tsi_dev_struct *tsi_dev);
/* start TSI interrupt */
int32_t hal_tsi_start_interrupt(hal_tsi_dev_struct *tsi_dev, hal_tsi_irq_struct *p_irq);
/* stop TSI interrupt */
int32_t hal_tsi_stop_interrupt(hal_tsi_dev_struct *tsi_dev);
/* TSI interrupt handler content function, which is merely used in tsi_handler */
void hal_tsi_irq(hal_tsi_dev_struct *tsi_dev);
/* set user-defined interrupt callback function
    which will be registered and called when corresponding interrupt be triggered */
void hal_tsi_irq_handle_set(hal_tsi_dev_struct *tsi_dev, hal_tsi_irq_struct *p_irq);
/* reset all user-defined interrupt callback function
    which will be registered and called when corresponding interrupt be triggered */
void hal_tsi_irq_handle_all_reset(hal_tsi_dev_struct *tsi_dev);
/* get the cycle number of specific group as soon as a charge-transfer sequence completes */
uint16_t hal_tsi_group_cycle_get(hal_tsi_dev_struct *tsi_dev, uint8_t group_id);
/* configure TSI pins */
void hal_tsi_pins_config(hal_tsi_dev_struct *tsi_dev, hal_tsi_init_struct *pins_config);
/* TSI poll for charge-transfer sequence complete */
void hal_tsi_poll_transfer(hal_tsi_dev_struct *tsi_dev);

