PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_tsi.h
/* simple interface */
/* enable TSI module */
void hals_tsi_enable(void);
/* disable TSI module */
void hals_tsi_disable(void);
/* enable sample pin */
void hals_tsi_sample_pin_enable(uint32_t sample);
/* disable sample pin */
void hals_tsi_sample_pin_disable(uint32_t sample);
/* enable channel pin */
void hals_tsi_channel_pin_enable(uint32_t channel);
/* disable channel pin */
void hals_tsi_channel_pin_disable(uint32_t channel);

/* start a charge-transfer sequence when TSI is in software trigger mode */
void hals_tsi_software_start(void);
/* stop a charge-transfer sequence when TSI is in software trigger mode */
void hals_tsi_software_stop(void);
/* configure TSI triggering by hardware */
void hals_tsi_hardware_mode_config(uint8_t trigger_edge);
/* configure TSI pin mode when charge-transfer sequence is IDLE */
void hals_tsi_pin_mode_config(uint8_t pin_mode);
/* configure extend charge state */
void hals_tsi_extend_charge_config(ControlStatus extend, uint8_t prescaler, uint32_t max_duration);

/* configure charge pulse and transfer pulse */
void hals_tsi_pulse_config(uint32_t prescaler, uint32_t charge_duration, uint32_t transfer_duration);
/* configure the max cycle number of a charge-transfer sequence */
void hals_tsi_max_number_config(uint32_t max_number);
/* switch on hysteresis pin */
void hals_tsi_hysteresis_on(uint32_t group_pin);
/* switch off hysteresis pin */
void hals_tsi_hysteresis_off(uint32_t group_pin);
/* switch on analog pin */
void hals_tsi_analog_on(uint32_t group_pin);
/* switch off analog pin */
void hals_tsi_analog_off(uint32_t group_pin);

/* enable group */
void hals_tsi_group_enable(uint32_t group);
/* disable group */
void hals_tsi_group_disable(uint32_t group);
/* get group complete status */
FlagStatus hals_tsi_group_status_get(uint32_t group);

/* get TSI flag */
FlagStatus hals_tsi_flag_get(uint32_t flag);
/* clear TSI flag */
void hals_tsi_flag_clear(uint32_t flag);
/* enable TSI interrupt */
void hals_tsi_interrupt_enable(uint32_t source);
/* disable TSI interrupt */
void hals_tsi_interrupt_disable(uint32_t source);

#endif /* GD32F350 */

#endif /* GD32F3X0_HAL_TSI_H */
